export default {
  name: 'about',
  heroTitle: '我们相信，在未来的几十年里，3D 打印将和拍照一样简单。',
  containerTitle: '关于我们',
  containerText: [
    `随着 3D 打印机、激光雕刻机和 CNC 雕刻机等制造工具的普及，现在自己动手制作要比十年前普遍得多。我们团队就喜欢使用这些工具，
    并且希望更多人能像我们一样在日常生活中充分利用这些工具。因此，我们决心让这些工具能够更容易被普通消费者所用。无论您是 30 岁的工程师，
    80 岁的业余爱好者还是 10 岁的学生，我们都希望我们的产品能帮助您将想法变为现实。`,
    '我们有一支充满激情和才华的团队来实现这个梦想。我们深刻体会到，DIY 工具高昂的价格、难以确定的打印质量和学习的难度是阻碍人们开始自己的 DIY 项目的三个常见障碍。正因为如此，我们大力投身于软硬件开发和社区建设，以确保能够提供高质量、经济实惠且用户友好的制造机器。',
    '因为团队中有着一群热情的工程师，我们十分重视工程应用。我们坚信细节决定成败。我们从不会遗漏任何决定用户体验的细节。此外，我们还与用户保持密切和透明的沟通，以便我们可以创造出用户所需的东西。',
    '我们的 3D 打印之旅始于 2016 年 8 月。半年后，我们顺利推出首个项目，该项目在 Kickstarter 上筹得 220 万美元。路漫漫其修远兮，吾将上下而求索。凭借我们的热情和毅力，我们相信，在未来几十年里，3D 打印将和拍照一样简单。'
  ]
}
