/* eslint-disable */
export default {
  name: 'repair',
  containerCon: {
    h2text: 'Snapmaker 有限保修政策',
    breadcrumb1: '主页',
    breadcrumb2: '服务与支持',
    breadcrumb3: '维修服务',
    bgPcSrc: 'https://snapmaker.oss-cn-beijing.aliyuncs.com/snapmaker.cn/static/img/10-warranty.png',
    bgMobileSrc: 'https://snapmaker.oss-cn-beijing.aliyuncs.com/snapmaker.cn/static/img/m-10-warranty.png',
  },
  containerBlock: {
    blockSpecial1: {
      h2text: '概述',
      content1: `根据以下条款和条件，Snapmaker 为从 Snapmaker 或 Snapmaker 授权经销商购买的 Snapmaker 三合一 3D 打印机系列产品（以下称“产品”）的主要模块提供有限保修服务：`,
      content2: `保修日自首次交付给终端客户之日起算，以原始客户的采购发票上的日期为准。仅原始购买者有权要求提供保修服务。`,
      content3: '本保修仅适用于以下部件。保修零部件的保修期如下：',
      tableData: {
        theadData: [
          '产品',
          '保修零部件',
          '保修期',
        ],
        tbodyDataSpecial: {
          tdText1: 'Snapmaker 初代三合一 3D 打印机',
        },
        tbodyData: [
          [
            '控制器',
            '12个月',
          ],
          [
            '热床',
            '12个月',
          ],
          [
            '3D打印模组（不包括喷嘴）',
            '12个月',
          ],
          [
            '激光模组',
            '12个月',
          ],
          [
            'CNC模组',
            '12个月',
          ],
          [
            '直线模组',
            '12个月',
          ],
          [
            '触摸屏',
            '12个月',
          ],
          [
            '电源适配器',
            '12个月',
          ],
          [
            'Snapmaker 初代外罩',
            '外罩',
            '12个月',
          ],
          [
            '1600 mW 激光模组',
            '1600 mW 激光模组',
            '12个月',
          ],
        ],
        tbodyDataNormal1: {
            // tdText1: 'Snapmaker 2.0 Modular 3-in-1 3D Printers A150 / A250 / A350',
          tdText1: 'Snapmaker 2.0 模块化3D打印机 A150/A250/A350',
        },
        tbodyDataCon: [
            ['控制器',	'12个月'],
            ['热床',	'12个月'],
            ['3D打印模组（不包括喷嘴）',	'12个月'],
            ['激光模组',	'12个月'],
            ['CNC模组',	'12个月'],
            ['直线模组',	 '12个月'],
            ['触摸屏',	'12个月'],
            ['电源模组',	'12个月'],
            ['转换器',	'12个月'],
            ['Snapmaker 2.0 外罩',	'Snapmaker 2.0 外罩',	'12个月']
        ],
      },
      content4: '注：',
      olData: [
        '根据保修协议更换的新配件，将仍按照原有的保修期计算，不会重新计算保修期。',
      ],
    },
    blockNormal: [
//       {
//         h2text: '非保修政策保障范围',
//         h2plusText: '本保修政策不适用于以下情况：',
//         olData: [
//           '除保修零部件外的其他任何零部件；',
//           `因未遵守快速入门指南和在线手册中的说明而导致的任何故障或损坏，包括但不限于：不正确或不当的使用、安装、维护、操作和清洁等；`,
//           `因意外事故造成的故障或损坏，包括但不限于：火灾等自然灾害，以及脱落、碰撞、浸水等人为原因；`,
//           '使用第三方材料、附件或软件等造成的任何故障或损坏等；',
//           '正常磨损。',
//         ],
//       },
//       {
//         h2text: '使本保修失效的行为',
//         h2plusText: '以下行为将使本保修无效：',
//         olData: [
//           '对产品的任何硬件或固件进行的任何修改；',
//           '产品的滥用、误用或不当储存；',
//           '将产品用于任何非法用途；',
//           '由 Snapmaker 或 Snapmaker 授权经销商以外的经销商提供维修；',
//           '在产品中使用不支持、未经批准或不合适的耗材或材料；',
//           '未经 Snapmaker 或经销商授权而拆卸或修理。',
//         ],
//       },
        {
          h2text: '退货和退款服务',
          olData: [
            '情况1：在收到产品后的七个自然日内，在产品没有制造缺陷，没有被使用过，且仍然是新的或接近新的状态等情况下，您可以申请退货退款服务。',
            `情况2：在收到产品后的七个自然日内，如果产品存在制造缺陷，您可以申请退款退货服务。`,
          ],
          h2EndText1: '您需要将产品邮寄到指定的仓库，Snapmaker将会对寄回的产品进行检测以便确定问题所在。对于符合情况2的退货，Snapmaker将承担由此产生的邮费和税费等费用；符合情况1的退货，将由用户承担相应的邮费和税费等费用。 ',
          h2EndText2: '对于以上两种退货情况都需要收取手续费，一般为机器售价的10%，其余的将在产品检测完成后退还。',
          h3text: '以下情况我们有权拒绝提供退货退款服务：',
          h3olData: [
            '自收货日起超过 7 个自然日后提出退货要求的；',
            '寄回给Snapmaker的要求退货退款的产品原包装或原配件存在丢失、破损，或者产品不是新的或者类似新的状态，即存在破损、凹痕、划痕等问题；',
            '无法提供合法的购买凭证、单据或发票；',
            '未经授权使用或改造而对产品造成的任何故障或损坏，包括暴露在潮湿环境中、异物（例如水、油、沙子等）等进入，安装或操作不当；',
            '对产品的标签、序列号等进行标识进行撕毁、涂改等；',
            '因不可避免因素，如火灾、水灾、雷击、交通事故等不可抗拒力造成损坏的产品；',
            '在Snapmaker同意退货退款申请后，没有在7个自然日内将产品寄到指定仓库；',
            '本政策所述的其他情况。',
          ],
        },
    ],
    blockSpecial2: {
        h2text: '维修服务',
        h2plusText: '本保修服务不适用于以下的情形：',
        olData: [
          '除保修部件外的其他部件；',
          '由于未按照快速启动指南和在线手册中的说明进行操作而造成产品的任何缺陷或损坏，包括但不限于错误或不适当的使用、安装、维护、操作和清洗；',
          '由意外事故造成的任何缺陷或损坏，包括但不限于火灾等自然灾害，以及坠落、碰撞、泡水等人为原因；',
          '因使用第三方材料、配件或软件等造成的缺陷或损坏；',
          '机器的正常使用磨损。',
        ],
        actionstext: '以下的行为将使本维修服务失效：',
        actionsData: [
          '对产品的任何硬件或固件进行的任何修改；',
          '产品的滥用、误用或存放不当；',
          '将产品用于任何非法用途；',
          '由Snapmaker或者Snapmaker授权的分销商之外的其他分销商服务过；',
          '使用不支持、未经批准或不合适的耗材或材料；',
          '未经Snapmaker或经销商授权，擅自拆卸或维修。',
        ],
      cnAddText: '售后服务申请流程',
      cnSubAddText: '客户必须在保修期内向原始售货方（Snapmaker 或 Snapmaker 经销商）发出申请，即使售货方不在客户当前居住国。',
      h3text: '从 Snapmaker 购买的申请流程',
      h3pulsText: ' 如果产品最初是从 Snapmaker 购买的，请按照以下步骤申请保修：',
      liDataSpecial: {
        // TODO
        text1: '请在每次保修申请期间，通过下面的',
        spanText: '申请保修',
        text2: '按钮提交保修申请以及正式的采购发票，以供核对。同时发送电子邮件至',
        aHref: 'mailto:support@snapmaker.com',
        aText: 'support@snapmaker.com',
        text3: '',
      },
      liDataNor1: '申请将在 7 个工作日内得到确认。',
      liDataNor2: `如果申请合理，Snapmaker 将根据本保修条款免费纠正缺陷。
                 如果缺陷无法修复，Snapmaker 将在保修期内用相同的零部件免费更换保修零部件，或者，如果保修零部件不再生产，则用相同价值的类似零部件更换，或者提供适当的退款。`,
      h5text: `保修不包括为检查和/或维修而运输有缺陷的保修零部件的运输成本和税费，也不包括将更换或维修的保修零部件运回申请人的运输成本和税费。`,
      divButtonHref: 'http://snapmaker.mikecrm.com/uD78db7',
      divButtonText: '申请保修',
      bottomH3Text: '从 Snapmaker 授权经销商处购买的申请流程',
      bottomH3PlusText: `如果产品是最初从 Snapmaker 授权经销商处购买，则 Snapmaker 经销商将代表 Snapmaker 处理保修事宜。
        如果您需要技术支持或保修服务，请与您购买产品的 Snapmaker 经销商联系。`,
    },
  },
};
